Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.Add Method
 Adds a BinaryFilterExpressionItem object at the end of the collection.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Add(
	BinaryFilterExpressionItem Item
)
Public Sub Add (
	Item As BinaryFilterExpressionItem
)
Parameters
Item
Type: Tekla.Structures.Filtering.BinaryFilterExpressionItem
The object to add to the collection. This value cannot be null.
Implements
ICollection<T>.Add(T)
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the supplied item is null.
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace